public class Lesson12 {
    /**
     * Задание 12. Черепашка
     * На квадратной доске размером NхN расставлены случайные
     * целые положительные числа. Черепашка, находящаяся в
     * левом верхнем углу, мечтает попасть в правый нижний. При
     * этом, она может переползать только в клетку справа или в
     * клетку снизу (не наискосок) и хочет, чтобысумма всех чисел,
     * оказавшихся у нее на пути, была максимально возможной.
     * Показать на экране консоли эту сумму. Показать путь следования черепашки. Показать исходный массив в виде таблицы
     */

    public static void main(String[] args) {

    }

    public static int size = 8;
    public static int field = size * size;
}
